/* *******************************************************************************************
// Author:		biu~
// Last Date:	2018/02/XX
// 以定时器溢出为时间基准，周期性的调用的函数
// 时基处理部分，及时基处理初始化
/* ******************************************************************************************* */

#include "TIME_BASE.H"

/* *******************************************************************************************
// 时基时钟初始化
/* ******************************************************************************************* */
// 利用STC-ISP软件导出此函数：
static void Timer0Init(void)		//5毫秒@12.000MHz
{
	AUXR &= 0x7F;		//定时器时钟12T模式
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x78;		//设置定时初值
	TH0 = 0xEC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}

// 时基定时器初始化并开启中断总开关：
void InitInterrupt()
{
#ifdef T_0
	Timer0Init();
	ET0 = 1;
#else
	#ifdef T_1
		Timer1Init();
		ET1 = 1;
	#else
		#ifdef T_2
			Timer2Init();
			IE2 |= 0x04;
		#endif
	#endif
#endif
	EA = 1;
}

/* *******************************************************************************************
// 时基处理部分
/* ******************************************************************************************* */
void Timer_TimeBase_Isr () interrupt 1 using 1
{
	static u16 cp;
	TL0 = 0x78;
	TH0 = 0xEC;
	if (++ cp > OVERFLOW_TIMES)
	{
		cp = 0;
		// 以OVERFLOW_TIMES为时基：
		Timer_Clock();	    //时间时钟计时函数；
	}
	// 以定时器溢出时长为时基：

}