/* *******************************************************************************************
// Author: biu~
// 无法明确分类的用户功能函数存放处；
/* ******************************************************************************************* */

#include "Unknown_Category.H"

u8 Humidity = 0;                    //湿度；
u8 HumidLimit = DEFAULT_HUMIDLIMIT; //湿度调节阈值；
/* *******************************************************************************************
// 下载检测
/* ******************************************************************************************* */
// ISP区复位：
sfr ISP_CONTR = 0xE7;
void STC_ISP()
{
    P30 = 1;
    Delay1US();
    Delay1US();
    if (!P30)
        ISP_CONTR = 0x60;
}

/* *******************************************************************************************
// 将AD值转换为湿度百分比，在中断中调用；
// 无法得到具体参数，默认传感器为线性。
/* ******************************************************************************************* */
void AD_to_Humidity()
{
    u8 temp_ad;
    float min_accuracy;
    temp_ad = Read_PCF8591();
    if(temp_ad >= H_MAX_to_AD)
    {
        Humidity = 99;
    }
    else if (temp_ad <= H_MIN_to_AD)
    {
        Humidity = 0;
    }
    else
    {
        min_accuracy = (H_MAX_to_AD - H_MIN_to_AD) / 100;
//        Humidity = min_accuracy * (H_MAX_to_AD - temp_ad);
        Humidity = min_accuracy * (temp_ad - H_MIN_to_AD);      //根据实际情况选择计算公式；
    }
}
